0 1 3
2 4 6
5 7 8

1. 시작점 찾기
(0, 0)(1, 0), (2, 0)
(x, x)(x, x), (2, 1)
(x, x)(x, x), (2, 2)

(0, 0)(1, 0)(2, 0)(3, 0)
(x, x)(x, x)(x, x)(3, 1)
(x, x)(x, x)(x, x)(3, 2)
(x, x)(x, x)(x, x)(3, 3)
(x, x)(x, x)(x, x)(3, 4)


저 좌표s를 만들기
뭐에서부터 만드냐? = > 딱 2개
    1) 재귀,
    2) for == 0, 1, 2, 3, 4, ...., n
        2-1) 1중 for:
        2-2) 2중 for:
            0=> 0, 1, 2, 3...n
            1=> 0, 1, 2, 3...n
            2=> 0, 1, 2, 3...n
            ...
        ...

width=3
height=3
0=> (0, 0) #
1=> (1, 0) #
2=> (2, 0) #
3=> (2, 1) (width, 3-width)
4=> (2, 2) (width, 4-width)

width=4
height=3
0=> (0, 0) # (0, 0)
1=> (1, 0) # (1, 0)
2=> (2, 0) # (2, 0)
3=> (3, 0) # (3, 0)
4=> (3, 1) (width, 4-width)
5=> (3, 2) (width, 5-width)
6=> (3, 3) (width, 6-width)
7=> (3, 4) (width, 7-width)

2. 대각선 ㄱㄱ
    (n, m)= > (n-1, m-1)








width=3
height=3

q=[(0, n) for n in range(width)]
q.append((n, width-1) for n in range(1, height, 1))

for y, x in q:

# 0 (0,0)
# 1 (0,1) -> (1,0)
# 2 (0,2) -> (1,1) -> (2,0)
# 3 (1,2) -> (2,1)
# 4 (2,2)

1. 시작점을 찾음
2. 들어오는 패턴을 찾음

# 2중 for문 써야할때가
#   들어오는 패턴이 같을 경우
